<?xml version="1.0" ?>
<net name="Warehouse_model2_Lshape_data17-20_100ep" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,224,224"/>
			<output>
				<port id="0" names="input_1:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1/convolution/Transpose6887_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="64,3,7,7" size="18816"/>
			<output>
				<port id="0" names="conv1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5101_const" type="Const" version="opset1">
			<data element_type="f16" offset="18816" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" names="conv1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pool1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="3,3" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" names="norm1/cond/FusedBatchNormV3/Switch:0,pool1/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_mul_47764914/EltwiseUnsqueeze5125_const" type="Const" version="opset1">
			<data element_type="f16" offset="18944" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="norm1/cond/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_47784915/EltwiseUnsqueeze5129_const" type="Const" version="opset1">
			<data element_type="f16" offset="19072" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="norm1/cond/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="norm1/cond/Merge:0,norm1/cond/FusedBatchNormV3:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="reduction2/convolution/Transpose6891_const" type="Const" version="opset1">
			<data element_type="f16" offset="19200" shape="64,64,1,1" size="8192"/>
			<output>
				<port id="0" names="reduction2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="reduction2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="reduction2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="reduction2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5041_const" type="Const" version="opset1">
			<data element_type="f16" offset="27392" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" names="reduction2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="reduction2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="reduction2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="reduction2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reduction2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2/convolution/Transpose6895_const" type="Const" version="opset1">
			<data element_type="f16" offset="27520" shape="192,64,3,3" size="221184"/>
			<output>
				<port id="0" names="conv2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5009_const" type="Const" version="opset1">
			<data element_type="f16" offset="248704" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="conv2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="norm2/cond/FusedBatchNormV3/Switch:0,conv2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_mul_478047844916/EltwiseUnsqueeze5133_const" type="Const" version="opset1">
			<data element_type="f16" offset="249088" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="norm2/cond/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_478147864917/EltwiseUnsqueeze5137_const" type="Const" version="opset1">
			<data element_type="f16" offset="249472" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="norm2/cond/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="norm2/cond/Merge:0,norm2/cond/FusedBatchNormV3:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="pool2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" names="pool2/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="icp1_out0/convolution/Transpose6919_const" type="Const" version="opset1">
			<data element_type="f16" offset="249856" shape="64,192,1,1" size="24576"/>
			<output>
				<port id="0" names="icp1_out0/convolution/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="icp1_out0/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out0/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="icp1_out0/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4985_const" type="Const" version="opset1">
			<data element_type="f16" offset="274432" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" names="icp1_out0/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="icp1_out0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out0/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="icp1_out0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_out0/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="icp1_reduction1/convolution/Transpose6899_const" type="Const" version="opset1">
			<data element_type="f16" offset="274560" shape="96,192,1,1" size="36864"/>
			<output>
				<port id="0" names="icp1_reduction1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="icp1_reduction1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_reduction1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="icp1_reduction1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5001_const" type="Const" version="opset1">
			<data element_type="f16" offset="311424" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="icp1_reduction1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="icp1_reduction1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_reduction1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="icp1_reduction1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_reduction1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="icp1_out1/convolution/Transpose6903_const" type="Const" version="opset1">
			<data element_type="f16" offset="311616" shape="128,96,3,3" size="221184"/>
			<output>
				<port id="0" names="icp1_out1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="icp1_out1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="icp1_out1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5053_const" type="Const" version="opset1">
			<data element_type="f16" offset="532800" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" names="icp1_out1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="icp1_out1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="icp1_out1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_out1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="icp1_reduction2/convolution/Transpose6907_const" type="Const" version="opset1">
			<data element_type="f16" offset="533056" shape="16,192,1,1" size="6144"/>
			<output>
				<port id="0" names="icp1_reduction2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="icp1_reduction2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_reduction2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="icp1_reduction2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5077_const" type="Const" version="opset1">
			<data element_type="f16" offset="539200" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" names="icp1_reduction2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="icp1_reduction2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_reduction2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="icp1_reduction2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_reduction2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="icp1_out2/convolution/Transpose6911_const" type="Const" version="opset1">
			<data element_type="f16" offset="539232" shape="32,16,5,5" size="25600"/>
			<output>
				<port id="0" names="icp1_out2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="icp1_out2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="icp1_out2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4997_const" type="Const" version="opset1">
			<data element_type="f16" offset="564832" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" names="icp1_out2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="icp1_out2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="icp1_out2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_out2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="icp1_pool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_pool/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="icp1_out3/convolution/Transpose6915_const" type="Const" version="opset1">
			<data element_type="f16" offset="564896" shape="32,192,1,1" size="12288"/>
			<output>
				<port id="0" names="icp1_out3/convolution/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="icp1_out3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out3/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="icp1_out3/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5033_const" type="Const" version="opset1">
			<data element_type="f16" offset="577184" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" names="icp1_out3/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="icp1_out3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp1_out3/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="icp1_out3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp1_out3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="4" names="concatenate_1/concat:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="icp2_out0/convolution/Transpose6943_const" type="Const" version="opset1">
			<data element_type="f16" offset="577248" shape="128,256,1,1" size="65536"/>
			<output>
				<port id="0" names="icp2_out0/convolution/ReadVariableOp:0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="icp2_out0/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out0/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="icp2_out0/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5017_const" type="Const" version="opset1">
			<data element_type="f16" offset="642784" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" names="icp2_out0/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="icp2_out0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out0/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="icp2_out0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_out0/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="icp2_reduction1/convolution/Transpose6923_const" type="Const" version="opset1">
			<data element_type="f16" offset="643040" shape="128,256,1,1" size="65536"/>
			<output>
				<port id="0" names="icp2_reduction1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="icp2_reduction1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_reduction1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="icp2_reduction1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4925_const" type="Const" version="opset1">
			<data element_type="f16" offset="708576" shape="1,128,1,1" size="256"/>
			<output>
				<port id="0" names="icp2_reduction1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="icp2_reduction1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_reduction1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="icp2_reduction1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_reduction1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="icp2_out1/convolution/Transpose6927_const" type="Const" version="opset1">
			<data element_type="f16" offset="708832" shape="192,128,3,3" size="442368"/>
			<output>
				<port id="0" names="icp2_out1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>192</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="icp2_out1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="icp2_out1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5121_const" type="Const" version="opset1">
			<data element_type="f16" offset="1151200" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="icp2_out1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="icp2_out1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="icp2_out1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_out1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="icp2_reduction2/convolution/Transpose6931_const" type="Const" version="opset1">
			<data element_type="f16" offset="1151584" shape="32,256,1,1" size="16384"/>
			<output>
				<port id="0" names="icp2_reduction2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="icp2_reduction2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_reduction2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="icp2_reduction2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4969_const" type="Const" version="opset1">
			<data element_type="f16" offset="1167968" shape="1,32,1,1" size="64"/>
			<output>
				<port id="0" names="icp2_reduction2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="icp2_reduction2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_reduction2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="icp2_reduction2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_reduction2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="icp2_out2/convolution/Transpose6935_const" type="Const" version="opset1">
			<data element_type="f16" offset="1168032" shape="96,32,5,5" size="153600"/>
			<output>
				<port id="0" names="icp2_out2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>96</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="icp2_out2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>32</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out2/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="icp2_out2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5013_const" type="Const" version="opset1">
			<data element_type="f16" offset="1321632" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="icp2_out2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="icp2_out2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="icp2_out2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_out2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="icp2_pool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_pool/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="icp2_out3/convolution/Transpose6939_const" type="Const" version="opset1">
			<data element_type="f16" offset="1321824" shape="64,256,1,1" size="32768"/>
			<output>
				<port id="0" names="icp2_out3/convolution/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="icp2_out3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out3/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="icp2_out3/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5049_const" type="Const" version="opset1">
			<data element_type="f16" offset="1354592" shape="1,64,1,1" size="128"/>
			<output>
				<port id="0" names="icp2_out3/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="icp2_out3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icp2_out3/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="icp2_out3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icp2_out3/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="concatenate_2/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="4" names="concatenate_2/concat:0" precision="FP16">
					<dim>1</dim>
					<dim>480</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="icpO_in/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icpO_in/MaxPool:0" precision="FP16">
					<dim>1</dim>
					<dim>480</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="icpO_out0/convolution/Transpose7051_const" type="Const" version="opset1">
			<data element_type="f16" offset="1354720" shape="192,480,1,1" size="184320"/>
			<output>
				<port id="0" names="icpO_out0/convolution/ReadVariableOp:0" precision="FP16">
					<dim>192</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="icpO_out0/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_out0/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="icpO_out0/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4993_const" type="Const" version="opset1">
			<data element_type="f16" offset="1539040" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="icpO_out0/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="icpO_out0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_out0/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="icpO_out0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icpO_out0/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="icpO_reduction1/convolution/Transpose7031_const" type="Const" version="opset1">
			<data element_type="f16" offset="1539424" shape="96,480,1,1" size="92160"/>
			<output>
				<port id="0" names="icpO_reduction1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>96</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="icpO_reduction1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_reduction1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="icpO_reduction1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze4953_const" type="Const" version="opset1">
			<data element_type="f16" offset="1631584" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="icpO_reduction1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="icpO_reduction1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_reduction1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="icpO_reduction1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icpO_reduction1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="icpO_out1/convolution/Transpose7035_const" type="Const" version="opset1">
			<data element_type="f16" offset="1631776" shape="208,96,3,3" size="359424"/>
			<output>
				<port id="0" names="icpO_out1/convolution/ReadVariableOp:0" precision="FP16">
					<dim>208</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="icpO_out1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>208</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_out1/convolution:0" precision="FP16">
					<dim>1</dim>
					<dim>208</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="icpO_out1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze5105_const" type="Const" version="opset1">
			<data element_type="f16" offset="1991200" shape="1,208,1,1" size="416"/>
			<output>
				<port id="0" names="icpO_out1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="icpO_out1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="icpO_out1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>208</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="icpO_out1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" names="icpO_out1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>208</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="icpO_reduction2/convolution/Transpose7039_const" type="Const" version="opset1">
			<data element_type="f16" offset="1991616" shape="16,480,1,1" size="15360"/>
			<output>
				<port id="0" names="icpO_reduction2/convolution/ReadVariableOp:0" precision="FP16">
					<dim>16</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="icpO_reduction2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>480</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
